IRP/src/DataProcessors/FillingNewAreaAssistant/FillingNewAreaAssistant.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>FillingNewAreaAssistant</name>
  <attributes>
    <name>Area</name>
    <type>
      <types>CatalogRef.DataAreas</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyLocalization</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CompanyType</name>
    <type>
      <types>CatalogRef.CompanyTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DownloadRateType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CurrencyRateIntegrationSettings</name>
    <type>
      <types>CatalogRef.IntegrationSettings</types>
    </type>
  </attributes>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.Countries</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CreatedCurrencies</name>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CreatedCashAccounts</name>
    <attributes>
      <name>CashAccount</name>
      <type>
        <types>CatalogRef.CashAccounts</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CreatedBankAccounts</name>
    <attributes>
      <name>CashAccount</name>
      <type>
        <types>CatalogRef.CashAccounts</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

IRP/src/InformationRegisters/Taxes/Taxes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>Taxes</name>
 <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
 <resources>
  <name>Use</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <resources>
  <name>Priority</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </resources>
 <resources>
  <name>IncludeToLandedCost</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Tax</name>
  <type>
   <types>CatalogRef.Taxes</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/TaxSettings/TaxSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TaxSettings</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>TaxRate</name>
    <type>
      <types>CatalogRef.TaxRates</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Tax</name>
    <type>
      <types>CatalogRef.Taxes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ItemKey</name>
    <type>
      <types>CatalogRef.ItemKeys</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ItemType</name>
    <type>
      <types>CatalogRef.ItemTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Agreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/Enums/CurrencyType/CurrencyType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>CurrencyType</name>
 <enumValues>
  <name>Reporting</name>
 </enumValues>
 <enumValues>
  <name>Legal</name>
 </enumValues>
 <enumValues>
  <name>Agreement</name>
 </enumValues>
 <enumValues>
  <name>Budgeting</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/AgreementTypes/AgreementTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>AgreementTypes</name>
 <enumValues>
  <name>Customer</name>
 </enumValues>
 <enumValues>
  <name>Vendor</name>
 </enumValues>
 <enumValues>
  <name>Consignor</name>
 </enumValues>
 <enumValues>
  <name>TradeAgent</name>
 </enumValues>
 <enumValues>
  <name>Other</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/IntegrationSettings/IntegrationSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>IntegrationSettings</name>
  <attributes>
    <name>ExternalDataProc</name>
    <type>
      <types>CatalogRef.ExternalDataProc</types>
    </type>
  </attributes>
  <attributes>
    <name>ExternalDataProcSettings</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>IntegrationType</name>
    <type>
      <types>EnumRef.IntegrationType</types>
    </type>
  </attributes>
  <attributes>
    <name>StoreInSecureStorage</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ConnectionSetting</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>CatalogRef.IntegrationSettings</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Hide</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ConnectionSettingTest</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>CatalogRef.IntegrationSettings</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Hide</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Companies/Companies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Companies</name>
 <predefined>
  <items>
   <name>Default</name>
  </items>
 </predefined>
 <attributes>
  <name>Country</name>
  <type>
   <types>CatalogRef.Countries</types>
  </type>
 </attributes>
 <attributes>
  <name>MainCompany</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.CompanyLegalType</types>
  </type>
 </attributes>
 <attributes>
  <name>OurCompany</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostCurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostExpenseType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostFillEmptyAmount</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostPriceTypeForEmptyAmount</name>
  <type>
   <types>CatalogRef.PriceTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentStore</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </attributes>
 <attributes>
  <name>TaxID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>MainPhoneNumber</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryAccrualVacation</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>SalaryMaxDaysVacation</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryAccrualSickLeave</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>SalaryMaxDaysSickLeave</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryBasicPayroll</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PrintInfo</name>
  <type>
   <types>CatalogRef.PrintInfo</types>
  </type>
 </attributes>
 <attributes>
  <name>MainLegalAddress</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>LegalCurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>BillingEmail</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyRevaluationItem</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyRevaluationItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </attributes>
 <attributes>
  <name>BatchID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EntityID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Currencies/Currencies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Currencies</name>
 <predefined>
  <items>
   <name>Default</name>
  </items>
 </predefined>
 <attributes>
  <name>Symbol</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>3</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>NumericCode</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>3</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Taxes/Taxes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Taxes</name>
 <attributes>
  <name>ExternalDataProcSettings</name>
  <type>
   <types>ValueStorage</types>
  </type>
 </attributes>
 <attributes>
  <name>DELETE_ExternalDataProc</name>
  <type>
   <types>CatalogRef.ExternalDataProc</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.TaxType</types>
  </type>
 </attributes>
 <attributes>
  <name>Kind</name>
  <type>
   <types>EnumRef.TaxKind</types>
  </type>
 </attributes>
 <attributes>
  <name>TaxPayer</name>
  <type>
   <types>EnumRef.TaxPayers</types>
  </type>
 </attributes>
 <tabularSections>
  <name>TaxRates</name>
  <attributes>
   <name>TaxRate</name>
   <type>
    <types>CatalogRef.TaxRates</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>UseDocuments</name>
  <attributes>
   <name>DocumentName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>TransactionTypes</name>
  <attributes>
   <name>DocumentName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>TransactionType</name>
   <type>
    <types>EnumRef</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/TaxRates/TaxRates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>TaxRates</name>
 <attributes>
  <name>Rate</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>15</precision>
    <scale>12</scale>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>NoRate</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Country</name>
  <type>
   <types>CatalogRef.Countries</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/DataProcessors/FillingNewAreaAssistant/ObjectModule.bsl
#Region CreatingNewItems
	
Procedure CreateFinishData() Export
	Return;
EndProcedure

Procedure CreateCurrencyRateIntegrationSettings() Export
	
	Country = GetCountryByLocalizationCode(CompanyLocalization);
	If ValueIsFilled(Country) Then
		LegalCurrency = Country.Currency; 
	EndIf;
	
	// IntegrationSettings
	ClassifierElement = FillingFromClassifiers.GetElementFromClassifier("Catalog.IntegrationSettings", 
							"Description", CurrencyRateIntegrationSettingsName());
	If ClassifierElement <> Undefined Then
		ClassifierElement.ExternalDataProcSettings.DownloadRateType  = DownloadRateType;
		ClassifierElement.ExternalDataProcSettings.CurrencyFrom.Insert("NumericCode", LegalCurrency.NumericCode);
	EndIf;
	
	CurrencyRateIntegrationSettings = FillingFromClassifiers.CheckExistingAndCreateCatalogItemFromClassifierElement(
			"Catalog.IntegrationSettings", ClassifierElement);
	
EndProcedure

Procedure CreateCompany() Export
	
	// Company
	CompanyObject = Catalogs.Companies.CreateItem();
	CompanyObject.Our = True;
	FillPropertyValues(CompanyObject, 
						FillingFromClassifiers.DescriptionStructure(TrimAll(CompanyName)));
	CompanyObject.Type = CompanyType;
	
	If Not ValueIsFilled(Country) Then
		Country = GetCountryByLocalizationCode(CompanyLocalization);
	EndIf;
	CompanyObject.Country = Country;
	
	If Not ValueIsFilled(LegalCurrency) Then
		LegalCurrency = Country.Currency;
	EndIf;
	
	// Legal currency
	If ValueIsFilled(LegalCurrency) Then
		AttrStructure = New Structure();
		AttrStructure.Insert("Currency", LegalCurrency);
		AttrStructure.Insert("Source"  , CurrencyRateIntegrationSettings);
		AttrStructure.Insert("Type"    , Enums.CurrencyType.Legal);
		CompanyObject.Currencies.Add().MovementType = GetCurrencyMovementType(AttrStructure);
	EndIf;
	
	CompanyObject.Write();
	
	Company = CompanyObject.Ref;
	
	// User settings
	DataProcessors.FillingNewAreaAssistant.FillDefaultUserSettings(New Structure("Company", Company));
	
EndProcedure

Procedure CreateCurrencies(KeysArray) Export
	CreatedCurrencies.Clear();
	For Each KeyStructure In KeysArray Do
		For Each KeyAndValue In KeyStructure Do
			NewItem = FillingFromClassifiers.CreateCatalogItemFromClassifier("Catalog.Currencies", 
									KeyAndValue.Key, 
									KeyAndValue.Value);
			If ValueIsFilled(NewItem) Then
				CreatedCurrencies.Add().Currency = NewItem;
				CommonFunctionsClientServer.ShowUsersMessage(
					StrTemplate(R()["InfoMessage_002"], NewItem));
			EndIf;
		EndDo;
	EndDo;
EndProcedure

Procedure CreateAgreements() Export
	If Not ValueIsFilled(Company) Then
		Return;
	EndIf;
	
	PriceTypeSalesPrice    = GetPriceTypeByDescription("Sales price");
	PriceTypePurchasePrice = GetPriceTypeByDescription("Purchase price");
	
	MainStore = GetMainStore();
		
	For Each RowCurrency In CreatedCurrencies Do
		
		CurrencyDescription = TrimAll(RowCurrency.Currency.Description_en);
		
		// CurrencyMovementType
		AttrStructure = New Structure();
		AttrStructure.Insert("Currency", RowCurrency.Currency);
		AttrStructure.Insert("Type"    , Enums.CurrencyType.Agreement);
		CurrencyMovementTypeRef = GetCurrencyMovementType(AttrStructure);
		
		// Partner segment "Retail"
		PartnerSegment = Catalogs.PartnerSegments.CreateItem();
		FillPropertyValues(PartnerSegment, 
			FillingFromClassifiers.DescriptionStructure(StrTemplate(R()["Form_020"], CurrencyDescription)));
		PartnerSegment.Write();
		
		// Agreements
		// Customer agreement
		FillingData = New Structure();
		FillingData.Insert("CurrencyMovementType", CurrencyMovementTypeRef);
		FillingData.Insert("Date"                , CurrentSessionDate());
		FillingData.Insert("PartnerSegment"      , PartnerSegment.Ref);
		FillingData.Insert("Company"             , Company);
		FillingData.Insert("Standart"            , True);
		FillingData.Insert("PriceType"           , PriceTypeSalesPrice);
		FillingData.Insert("StartUsing"          , FillingData.Date);
		FillingData.Insert("Type"                , Enums.AgreementTypes.Customer);
		FillingData.Insert("Store"               , MainStore);
		
		CustomerAgreement = Catalogs.Agreements.CreateItem();
		FillPropertyValues(CustomerAgreement, FillingFromClassifiers.DescriptionStructure(
								StrTemplate(R().S_024, CurrencyDescription)));
		CustomerAgreement.Fill(FillingData);
		CustomerAgreement.Write();
		
		CommonFunctionsClientServer.ShowUsersMessage(
					StrTemplate(R()["InfoMessage_002"], CustomerAgreement));
					
		//  Vendor agreement
		FillingData = New Structure();
		FillingData.Insert("CurrencyMovementType", CurrencyMovementTypeRef);
		FillingData.Insert("Date"                , CurrentSessionDate());
		FillingData.Insert("PartnerSegment"      , PartnerSegment.Ref);
		FillingData.Insert("Company"             , Company);
		FillingData.Insert("Standart"            , True);
		FillingData.Insert("PriceType"           , PriceTypePurchasePrice);
		FillingData.Insert("StartUsing"          , FillingData.Date);
		FillingData.Insert("Type"                , Enums.AgreementTypes.Vendor);
		FillingData.Insert("Store"               , MainStore);
		
		VendorAgreement = Catalogs.Agreements.CreateItem();
		FillPropertyValues(VendorAgreement, FillingFromClassifiers.DescriptionStructure(
					StrTemplate(R().S_025, CurrencyDescription)));
		VendorAgreement.Fill(FillingData);
		VendorAgreement.Write();
		
		CommonFunctionsClientServer.ShowUsersMessage(
					StrTemplate(R()["InfoMessage_002"], VendorAgreement));
	EndDo;
EndProcedure

Procedure FillDefaultCompanyTaxes() Export
	If Not ValueIsFilled(Company) Then
		Return;
	EndIf;
	
	RecordPeriod = BegOfYear(CurrentSessionDate());
	
	// 1.Information register Taxes
	RecordSet = InformationRegisters.Taxes.CreateRecordSet();
	RecordSet.Filter.Company.Set(Company);
	
	// 2.Catalog Taxes
	ClassifierData = FillingFromClassifiers.GetClassifierData("Catalog.Taxes");
	For Each ClassifierElement In ClassifierData Do
		TaxRef = FillingFromClassifiers.CheckExistingAndCreateCatalogItemFromClassifierElement(
								"Catalog.Taxes", ClassifierElement);
		If ValueIsFilled(TaxRef) Then
			
			RecordSet.Filter.Tax.Set(TaxRef);
			RecordSet.Read();
			
			If Not RecordSet.Count() Then
				NewRecord = RecordSet.Add();
				NewRecord.Period  = RecordPeriod;
				NewRecord.Company = Company;
				NewRecord.Tax     = TaxRef;
				NewRecord.Use     = True;
				RecordSet.Write();
					
				CommonFunctionsClientServer.ShowUsersMessage(
						StrTemplate(R()["InfoMessage_002"], TaxRef));
			EndIf;
		EndIf;
	EndDo;
	
	// 3.Information register TaxSettings
	RecordSet = InformationRegisters.TaxSettings.CreateRecordSet();
	RecordSet.Filter.Company.Set(Company);
	
	ClassifierElements = FillingFromClassifiers.GetClassifierData("InformationRegister.TaxSettings");
	For Each ClassifierElement In ClassifierElements Do
		CurrentTax     = FillingFromClassifiers.CheckExistingAndCreateCatalogItemFromClassifierElement(
								"Catalog.Taxes", ClassifierElement.Tax);
		CurrentTaxRate = FillingFromClassifiers.CheckExistingAndCreateCatalogItemFromClassifierElement(
								"Catalog.TaxRates", ClassifierElement.TaxRate);
		
		RecordSet.Filter.Tax.Set(CurrentTax);
		RecordSet.Read();
		
		If Not RecordSet.Count() Then
			NewRecord = RecordSet.Add();
			NewRecord.Period  = RecordPeriod;
			NewRecord.Company = Company;
			NewRecord.Tax     = CurrentTax;
			NewRecord.TaxRate = CurrentTaxRate;
			RecordSet.Write();
					
			CommonFunctionsClientServer.ShowUsersMessage(
					StrTemplate(R()["InfoMessage_002"], CurrentTaxRate));
		EndIf;
	EndDo;
	
EndProcedure

Procedure CreateDefaultCashAndBankAccounts() Export
	If Not CreatedCashAccounts.Count() Then
		ClassifierElement = FillingFromClassifiers.GetElementFromClassifier("Catalog.CashAccounts", 
							"Description_en", 
							"Main cash account");
		If ClassifierElement <> Undefined Then
			ClassifierElement.Insert("Company", Company);
			FillingFromClassifiers.CreateCatalogItemFromClassifierElement("Catalog.CashAccounts", ClassifierElement);
		EndIf;
	EndIf;
	
	If Not CreatedBankAccounts.Count() Then
		ClassifierElement = FillingFromClassifiers.GetElementFromClassifier("Catalog.CashAccounts", 
							"Description_en", 
							"Main bank account");
		If ClassifierElement <> Undefined Then
			ClassifierElement.Insert("Company", Company);
			FillingFromClassifiers.CreateCatalogItemFromClassifierElement("Catalog.CashAccounts", ClassifierElement);
		EndIf;
	EndIf;
	
EndProcedure

#EndRegion


Function GetCountryByLocalizationCode(LocalizationCode)
	Query = New Query(
	"SELECT TOP 1
	|	Countries.Ref
	|FROM
	|	Catalog.Countries AS Countries
	|WHERE
	|	Countries.LocalizationCode = &LocalizationCode");
	Query.SetParameter("LocalizationCode", CompanyLocalization);
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		Return Selection.Ref;
	EndIf;
	
	// Create from classifier
	Return FillingFromClassifiers.CreateCatalogItemFromClassifier("Catalog.Countries", "LocalizationCode", LocalizationCode);
EndFunction

Function GetPriceTypeByDescription(Description_en)
	Query = New Query(
	"SELECT TOP 1
	|	PriceTypes.Ref
	|FROM
	|	Catalog.PriceTypes AS PriceTypes
	|WHERE
	|	PriceTypes.Description_en = &Description_en");
	Query.SetParameter("Description_en", Description_en);
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		Return Selection.Ref;
	EndIf;
	
	// Create from classifier
	Return FillingFromClassifiers.CreateCatalogItemFromClassifier("Catalog.PriceTypes", 
							"Description_en", 
							Description_en);
EndFunction

Function GetCurrencyMovementType(AttrStructure)
	QueryBuilderText =
	"SELECT TOP 1
	|	Table.Ref AS Ref,
	|	Table.DeletionMark,
	|	Table.Currency,
	|	Table.Source,
	|	Table.Type
	|FROM
	|	ChartOfCharacteristicTypes.CurrencyMovementType AS Table
	|WHERE
	|	NOT Table.DeletionMark";
	
	QueryBuilder = New QueryBuilder(QueryBuilderText);
	QueryBuilder.FillSettings();
	For Each AttrKeyAndValue In AttrStructure Do
		NewFilter = QueryBuilder.Filter.Add(AttrKeyAndValue.Key);
		NewFilter.Use = True;
		NewFilter.ComparisonType = ComparisonType.Equal;
		NewFilter.Value = AttrKeyAndValue.Value;
	EndDo;
	Query = QueryBuilder.GetQuery();

	Selection = Query.Execute().Select();
	If Selection.Next() Then
		Return Selection.Ref;
	EndIf;

	NewObject = ChartsOfCharacteristicTypes.CurrencyMovementType.CreateItem();
	FillPropertyValues(NewObject, FillingFromClassifiers.DescriptionStructure(TrimAll(LegalCurrency)));
	FillPropertyValues(NewObject, AttrStructure);
	NewObject.Write();

	Return NewObject.Ref;
EndFunction

Function GetMainStore()
	Query = New Query(
	"SELECT TOP 1
	|	Table.Ref AS Ref
	|FROM
	|	Catalog.Stores AS Table
	|WHERE
	|	NOT Table.DeletionMark
	|	AND Table.Description_en = &MainStoreDesc
	|");
	Query.SetParameter("MainStoreDesc", "Main store");
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		Return Selection.Ref;
	EndIf;

	Return FillingFromClassifiers.CreateCatalogItemFromClassifier("Catalog.Stores", 
							"Description_en", 
							"Main store");
EndFunction

Function CurrencyRateIntegrationSettingsName() Export
	Return "tcmb_gov_tr (legal currency)";
EndFunction
